{
  "Shrek": [
    "That'll do, Donkey. That'll do.",
    "That must be Lord Farquaad's castle. Do you think he's maybe compensating for something?",
    "Well, actually, that would be a giant. Now, ogres — oh, they're much worse. They'll make a suit from your freshly peeled skin! They'll shave your liver, squeeze the jelly from your eyes! Actually, it's quite good on toast.",
    "Well, it's no wonder you don't have any friends.",
    "Ogres are like onions.",
    "Hey! I'm no one's messenger boy, all right? I'm a delivery boy.",
    "There's a stack of freshly made waffles in the middle of the forest! Don't you find that a wee bit suspicious?",
    "Donkey, two things, OK? Shut… up.",
    "Donkey, if that was me, you'd be dead. That's brimstone… we must be getting close.",
    "What are you doing in my swamp!?",
    "Well my stomach aches and my palms just got sweaty, must be a high school.",
    "Someday, I will repay you. Unless, of course, I can't find you. Or I forget.",
    "After a while, you learn to ignore the names people call you and just trust who you are.",
    "You know what the best part of today was? I got the chance to fall in love with you all over again.",
    "All right, you're going the right way for a smack bottom.",
    "You know what? Maybe there's a good reason donkeys shouldn't talk.",
    "You know, Donkey, sometimes things are more than they appear.",
    "This is the part where you run away.",
    "I like my privacy.",
    "Roar!",
    "Once upon a time, there was a lovely princess. But she had an enchantment upon her of a fearful sort which could only be broken by love's first kiss. She was locked away in a castle guarded by a terrible fire-breathing dragon. Many brave knights had attempted to free her from this dreadful prison, but none prevailed. She waited in the dragon's keep, in the highest room of the tallest tower, for her true love and true love's first kiss… like that's ever gonna happen. What a load of…"
  ],
  "Donkey": [
    "Wow! Let's do that again!",
    "Only a true friend would be that truly honest.",
    "Because that's what friends do, they FORGIVE EACH OTHER!",
    "This'll be fun. We'll stay up late, swapping manly stories, and in the morning… I'm making waffles!",
    "I like that boulder. That is a nice boulder.",
    "You might have seen a housefly, maybe even a superfly, but I bet you ain't never seen a donkey fly.",
    "Don't you want to tell me about your trip? How about a game of Parcheesi?",
    "Please! I don't wanna go back there. You don't know what it's like to be considered a freak… well, maybe you do, but that's why we gotta stick together. You gotta let me stay!",
    "Wow, that was really scary, and if you don't mind me saying, if that don't work, your breath will certainly get the job done, 'cause you definitely need some Tic Tacs or something 'cause your breath STINKS.",
    "It's gonna be champagne wishes and caviar dreams from now on.",
    "Oh, Shrek. Don't worry; things just seem bad because it's dark and rainy and Fiona's father hired a sleazy hitman to whack you. It'll be better in the morning. You'll see.",
    "Man, you gotta warn somebody before you crack one like that. My mouth was open and everything.",
    "And then one time I ate some rotten berries. Man, there were some strong gases eeking outta my butt that day.",
    "Blue flower, red thorns. Blue flower, red thorns. Blue flower, red thorns. Man, this would be so much easier if I wasn't color blind!",
    "You know what ELSE everybody likes? Parfaits! Have you ever met a person, you say, 'Let's get some parfait,' they say, 'Hell no, I don't like no parfait'? Parfaits are delicious!",
    "Wake up and smell the pheromones.",
    "Before this is over, I'm gonna need a whole lot of serious therapy. Look at my eye twitchin'.",
    "C'mon, princess, you're not that ugly. All right, you are ugly. But you're only like this at night. Shrek's ugly 24/7.",
    "Huh, celebrity marriages. They never last, do they?",
    "Oh, what large teeth you have. I mean, white sparkly teeth. I know you probably hear this all the time from your food, but you must bleach or something, 'cause that's one dazzling smile you got there. And do I detect a hint of minty freshness?",
    "All right, nobody move! I got a dragon here, and I'm not afraid to use it. I'm a donkey on the edge!",
    "Don't die, Shrek. And if you see any long tunnels, stay away from the light!",
    "She called me a noble steed.",
    "You, uh, you don't entertain much, do you?",
    "You cut me deep, Shrek. You cut me real deep just now.",
    "That's another thing we have in common. I hate it when you've got someone in your face, you try to give someone a hint and they won't leave, and then there's that big awkward silence, you know?",
    "Oh! Pick me! Pick me! Me! Me! Meeee!",
    "Don't mess wit' me. I'm the Stair Master. I've mastered the stairs. I wish I had a step right here, I could step here and here and here and step all over it."
  ],
  "Gingerbread Man": [
    "Eat me!",
    "You're a monster.",
    "Don't tell him anything!",
    "No, not the buttons… not my gumdrop buttons!",
    "OK… I'll tell you. Do you know the Muffin Man?",
    "Well, she's married to the Muffin Man.",
    "It's ALIVE!",
    "I hate these ball shows. They bore me to tears! Flip over to Wheel of Torture.",
    "It looks like we're up chocolate creek without a popsicle stick.",
    "Fire up the ovens, Muffin Man! We've got a big order to fill.",
    "Quick, rewind it!",
    "God bless us, everyone."
  ],
  "Other": [
    "Donkey: 'Nobody said I have the right to remain silent!' Shrek: 'Donkey, you have the right to remain silent. What you lack is the capacity.'",
    "Lord Farquaad: 'What's that? It's hideous!' Shrek: 'Well, that's not very nice. It's just a donkey.'",
    "'Some of you may die, but it's a sacrifice I'm willing to make.' — Lord Farquaad",
    "'Shrek, Fiona…will you accept an old frog's apology and my blessing?' — King Harold",
    "'Five shillings for the possessed toy. Take it away.' — Captain of Guards",
    "Donkey: 'Whoa. Look at that. Who'd wanna live in a place like that?' Shrek: 'That would be my home.'",
    "'Good morning. Um, how do you like your eggs?' — Princess Fiona",
    "'Although she lives with seven other men, she's not easy.' — Magic Mirror",
    "'I'm not a puppet. I'm a real boy.' — Pinocchio",
    "Princess Fiona: 'What kind of a knight are you?' Shrek: 'One of a kind.'",
    "Donkey: 'Can I stay with you? Please?' Shrek: 'Of course.' Donkey: 'Really?' Shrek: 'NO.'",
    "'Yes, I know the muffin man. Who lives on Drury Lane?' — Lord Farquaad",
    "Princess Fiona: 'You didn't slay the dragon?' Shrek: 'It's on my to-do list. Now come on.'",
    "Donkey: 'Oh, this is another one of those onion things, isn't it?' Shrek: 'No, this is one of those drop it and leave it alone things.'",
    "'There's an arrow in your butt.' — Princess Fiona",
    "'Welcome to Duloc, such a perfect town / Here we have some rules, let us lay them down / Don't make waves, stay in line, and we'll get along fine / Duloc is a perfect place, please keep off the grass, shine your shoes, wipe your… face / Duloc is, Duloc is, Duloc is a perfect place.' — Info Booth Puppets",
    "'I'm not the monster here. You are. You and the rest of that fairy tale trash, poisoning my perfect world. Now tell me!' — Lord Farquaad",
    "'He hoofed unt he poofed unt he... signed an eviction notice.' — Little Pig",
    "'OK, let me get this straight: You gonna go fight a dragon and rescue a princess just so Farquaad'll give you back your swamp, which you only don't have 'cos he filled it full of freaks in the first place, is that about right?' — Donkey",
    "'You're so wrapped up in layers, onion boy, you're afraid of your own feelings.' — Donkey"
  ]
}